#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=eb2ebbdb-f6b7-489b-a292-cdd76f84f3f0]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6bf4a7ea-9952-4de7-8407-6914863d6fb6]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f32fbf2d-75df-44a0-8f57-a8ac02ee0432]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bc87549a-1f46-470f-abcf-750225a1846b]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ebc92afc-6a7a-4a74-a8cc-69fc0ca7b6f2]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=09cc2a7d-7985-4b4c-93b0-e67399824cd5]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3d317744-172f-4573-8baf-3812a2493578]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=177d4a0c-39d1-40cf-994b-a4e0528ab75c]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49470a5b-df0e-4461-9937-98bc92169d12]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-28-test-4-b-ce-id-non-prod-5911.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=29f2e000-710d-4665-81f8-a6435f59c77e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=510bcaef-7de4-422f-801f-495a523d5d11]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d1ee7f4-dc06-497d-b305-599d58985448]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=699e8064-a4e6-4432-b5aa-e5bdbbcac8bb]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=19a6e226-0f97-40bf-8249-86b3b1cfd90a]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d89973b9-1d81-4195-8900-bf4f11b9091a]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71187e43-256b-44f4-84e9-0bf6706f6ce6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f32acbb7-bf93-4b76-a104-99d74df97f59]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=63e1a681-ee52-4328-91b1-04570180e239]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56fcc3e0-be75-47be-b2aa-8abf33b3e67d]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b40f5701-890b-43ac-8549-1f5860557b48]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=260fd095-6dd3-4ffa-b7e2-08f35c4c012d]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f49e1d76-b89b-4617-924f-d01b112ca1ba]
module.keycloak_dev.module.onestopauth_basic.module.client_march-2-b-ce-id-non-prod-to-prod-6043.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d7b59495-fd8e-46af-ba38-ccbfe9c729d2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=59b7ccff-ffa1-45fd-a2c4-a0db7d1cc454]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=86720f10-ba81-4365-85cd-599b79f258dc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e41cb5-7782-4314-81ee-445364b0753c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3ad1d3b0-ee8d-4246-ba21-cd01d2786281]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a1d26907-f28d-4c71-ae7c-18474511b1e9]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a564a503-cd0e-4ecb-ad80-6345c90fefc6]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f8477a8-9469-4178-8961-02ed2da74010]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2675.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=899ff4df-5513-47d9-9984-159efbad59ad]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fc75240d-2577-4ef3-9b83-67a00b42ec3b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a049900-08f0-455d-8e60-117d6b1b65e8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9f98243-d304-4942-9acb-1f529fee9b82]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=893c5928-8dcf-407c-954c-147df4dbbec6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=220d2b7d-e07b-4473-9193-58365db642e7]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f8cd2359-e958-4919-bac9-a9ade988d395]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7bd00ac1-3007-4ecb-8fb3-b6501ae95206]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=036668af-7719-4bfa-8867-bfbef7858a10]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8f6e066a-10d9-4e1d-acc6-18552e0672eb]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a296cdc7-1dfd-4f4f-af9e-d975a5df1295]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bb3c67ec-8d55-41f1-8693-e54976d94395]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=669e5fe0-0958-44ed-a09f-f0acec518c41]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=107e4a5e-8c69-4353-baca-393cb5deafce]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fc42fcba-dc1b-45de-9989-63598d287a38]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=53c72be5-1e29-4b12-a836-706e45bf616d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=16847230-7309-4697-929e-210c7cf7c79a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=10a6448d-c0c5-4e16-9eab-e2a3a72e0ad3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3decb7a5-e19b-4ed5-afc7-7ee4e877bd9d]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=081dab7e-0c77-4ee4-8106-c50f59e90ccf]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=135749c2-7e36-45dd-b0bc-89f87becc968]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9ed513f3-af1b-45d1-94bd-81d8c85e1bd2]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8d92bbfc-4471-4075-b9fb-842e45d1f99e]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c5549bba-7904-48f9-835f-111dcfed00cc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=71413233-8ae0-4837-a08e-63981d3a9aa3]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=976f9c5c-ddc3-4c10-b809-2b043ed2f139]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d157e9d5-a8c4-4cb2-a3d7-71d92cbfd919]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=13a0151c-9636-4a0a-a4b3-2fed549eb963]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b70b7bd7-fbeb-4a13-a289-ab47268751e1]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=98a24be3-1e91-4a9a-a4f3-d723476cd682]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=31a46007-7914-49cb-ac4f-f77fa705a4e3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidtest-5446.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=6ef9bf26-cd89-4ab0-89c5-a24fe9e7c6a9]
module.keycloak_dev.module.onestopauth_basic.module.client_feb-24-test-2-5645.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c521e24d-fbc2-413b-9154-0e933c27e441]
module.keycloak_dev.module.onestopauth_basic.module.client_bceidbasic-5413.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8f208ec4-fcf6-4314-9cf4-65dfe89f523b]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1804d617-0cf7-44f7-be0b-ef65c3cdee8f]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8f8bb1a5-68b1-4441-a6d0-553586fc895d]
module.keycloak_dev.module.onestopauth_basic.module.client_testrequest-10.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c90d648a-d756-4dec-99b4-0b35b50ea462]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=000292c8-5e5c-4d34-a503-488f4cdbb3d6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5e79c1fb-5081-4b53-b637-6b42cec40c12]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3cf62cff-4c51-4df1-9c03-0747d294026c]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=655e1e48-72b4-45e4-ad75-0223b0e7021b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fedc4b5-1941-4368-8c93-be590b0670f8]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d093c22-ba7c-4d85-94bc-e3430d06f4fe]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3559989c-f390-416f-b178-dde31ae043eb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6f59d5e7-b118-461d-97c7-cbcba6290356]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=30f18071-66dd-4d05-ab42-ca8ba6098ad0]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=33a4b098-9486-40a2-8616-e1e4071a890a]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4de6858a-b6f7-42a2-89c3-69f32bbd077c]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2bc2550d-5dfa-4f4a-8ad3-5ff736266247]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ed67cd6c-da6a-4f10-8abd-7a8e659811c1]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=898c3868-562b-4d56-b837-1121261ba141]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7e47dc2e-8bb4-4946-8eea-db44bfc8ea13]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=15ff4ea0-70ea-441f-b423-8bd2e53c7fef]
module.keycloak_dev.module.onestopauth_basic.module.client_sdfa-3334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eeda35f9-0a14-4ba5-bc31-c890c54594ed]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5ba3baf8-c971-484a-bf4a-e652e1fea0f4]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f0c402eb-97b1-4384-9ca3-5330ca3059d1]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=50d10ec2-4cf1-4af7-8c92-91cc5b91259b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbc1d716-2a45-459d-86cd-d16b42d6604e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b91fdc2-3e61-4481-b6c9-55f044b76a39]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a46b9e29-bcfb-45f6-b769-3cf9086a2b81]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2776.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6bc93bd1-34a3-45bb-ba59-0f80457c55d4]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-3-test-b-ce-id-non-p-rod-6139"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-3-test-b-ce-id-non-p-rod-6139"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "march-3-test-b-ce-id-non-p-rod-6139"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-3-test-b-ce-id-non-p-rod-6139"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
      + web_origins                              = [
          + "+",
          + "https:///www.test.ca/devChange",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "march-3-test-b-ce-id-non-p-rod-6139"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "march-3-test-b-ce-id-non-p-rod-6139"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "march-3-test-b-ce-id-non-p-rod-6139"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "march-3-test-b-ce-id-non-p-rod-6139"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.test.ca/testCHANGED",
        ]
      + web_origins                              = [
          + "+",
          + "https://www.test.ca/testCHANGED",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3681 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*